Ran Plan for project: `my_infra` dir: `my_infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.this[0] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-12345678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "common_key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-056a6b58a47bf2d9f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-bdcef1ab9139d8ca0"
      + tags                                 = {
          + "Name" = "myvm-1"
        }
      + tags_all                             = {
          + "Name" = "myvm-1"
        }
      + tenancy                              = "default"
      + user_data                            = "119dae0abb5ecbde01edb1383ccb7cb1b6814f80"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-056a6b58a47bf2d9f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = 1
          + threads_per_core = 2
        }

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = false
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "ip-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.this[1] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-12345678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "common_key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-056a6b58a47bf2d9f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-bdcef1ab9139d8ca0"
      + tags                                 = {
          + "Name" = "myvm-2"
        }
      + tags_all                             = {
          + "Name" = "myvm-2"
        }
      + tenancy                              = "default"
      + user_data                            = "119c614d2c78a705fc650d1dbde16d7ffbac80eb"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-056a6b58a47bf2d9f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = 1
          + threads_per_core = 2
        }

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = false
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "ip-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.this[2] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-12345678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "common_key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-056a6b58a47bf2d9f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-bdcef1ab9139d8ca0"
      + tags                                 = {
          + "Name" = "myvm-3"
        }
      + tags_all                             = {
          + "Name" = "myvm-3"
        }
      + tenancy                              = "default"
      + user_data                            = "d27fc6a3c15296ade083b9a164d8256dcb62a156"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-056a6b58a47bf2d9f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = 1
          + threads_per_core = 2
        }

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = false
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "ip-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.this[3] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-12345678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "common_key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-056a6b58a47bf2d9f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-bdcef1ab9139d8ca0"
      + tags                                 = {
          + "Name" = "myvm-4"
        }
      + tags_all                             = {
          + "Name" = "myvm-4"
        }
      + tenancy                              = "default"
      + user_data                            = "8cf857b605fc00cd0f33ffaecfbfaca0640a0e11"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-056a6b58a47bf2d9f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = 1
          + threads_per_core = 2
        }

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = false
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "ip-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # aws_instance.this[4] will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-12345678"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = false
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + hibernation                          = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "stop"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "common_key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = 0
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-056a6b58a47bf2d9f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-bdcef1ab9139d8ca0"
      + tags                                 = {
          + "Name" = "myvm-5"
        }
      + tags_all                             = {
          + "Name" = "myvm-5"
        }
      + tenancy                              = "default"
      + user_data                            = "83834e97a4bf514cc197d045c34fcf8b45258ece"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-056a6b58a47bf2d9f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = 1
          + threads_per_core = 2
        }

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device (known after apply)

      + enclave_options {
          + enabled = false
        }

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options {
          + auto_recovery = "default"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "ip-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p my_infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.nkcs.site/lock?id=niteeshchaudhary%252Fiac%252Fmy_infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p my_infra
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```